# LineCircleIntersect

## Description
Finds the intersection points of a line and a circle.

```pascal
FUNCTION LineCircleIntersect(
				begPt   : VECTOR;
				endPt   : VECTOR;
				cenPt   : VECTOR;
				radius  : REAL;
				VAR pt1 : VECTOR;
				VAR pt2 : VECTOR) : BOOLEAN;
```

```python

def vs.LineCircleIntersect(begPt, endPt, cenPt, radius):
    return (BOOLEAN, pt1, pt2)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|begPt|VECTOR||
|endPt|VECTOR||
|cenPt|VECTOR||
|radius|REAL||
|pt1|VECTOR||
|pt2|VECTOR||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation